# ElementIdParameterValue Class

---
A class that holds a ElementId value of a parameter element.
SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBElementIdParameterValue
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ElementIdParameterValue : ParameterValue

    Public Class ElementIdParameterValue
    	Inherits ParameterValue

    public ref class ElementIdParameterValue : public ParameterValue

    type ElementIdParameterValue =
        class
            inherit ParameterValue
        end
The ElementIdParameterValue type exposes the following members.
| Name| Description
---|---|---
| ElementIdParameterValue|  Default constructor
| ElementIdParameterValue(ElementId)|  Value constructor
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ParameterValue)
| Value|  The stored value
Top
| Name| Description
---|---|---
| Copy|  Makes an identical copy of the given parameter value. (Inherited from ParameterValue)
| Dispose| (Inherited from ParameterValue)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsEqual|  Tests equality with another instance of the same class. (Inherited from ParameterValue)
| IsSameType|  Tests another instance is of the same value type. (Inherited from ParameterValue)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace